# Load to MySQL

INDEX

In [2]:
# %pip install mysql-connector-python

In [24]:
import pandas as pd
import mysql.connector as conn

In [14]:
with open('../pswd_mysql.txt', 'r') as file:
    paswd = file.read().strip()

In [15]:
conexion = conn.connect(host='localhost',
                        user='root',
                        password=paswd)

cursor = conexion.cursor()
cursor

## Create neuropapers_db

In [17]:
cursor.execute('drop database if exists neuropapers_db;')
cursor.execute('create database neuropapers_db;')

In [18]:
conexion = conn.connect(host='localhost', 
                        user='root',     
                        passwd=paswd,  
                        database='neuropapers_db')

cursor = conexion.cursor()

In [19]:
c = cursor.execute
c

## Create Tables

In [20]:
c('drop table if exists universities;')

query = '''
create table universities(
        univ_id int primary key not null,
        rank_2024 varchar(50),
        name varchar(50),
        country varchar(50),
        location float,
        academic_reputation varchar(10000),
        latitude varchar(50),
        longitude varchar(50)
        );
'''

c(query)

In [21]:
cursor.execute('show tables;')

for e in cursor:
    print(e)

('universities',)

## Fill tables

### Universities

In [25]:
universities = pd.read_csv('../data/universities/universities_db.csv')

In [27]:
universities.head(2)

,Unnamed: 0,Rank_2024,Institution_Name,Country,Location,Academic_Reputation,Latitude,Longitude
0,0,1,Massachusetts Institute of Technology (MIT),US,United States,100.0,42.360091,-71.094160
1,1,2,University of Cambridge,UK,United Kingdom,100.0,55.378051,-3.435973

In [28]:
nombre_tabla = 'universities'
nombres_columnas = ','.join(universities.columns)


for i in range(universities.shape[0]):     
    
    valores = tuple(universities.iloc[i].values)    
    
    insert_query = f'insert into {nombre_tabla} ({nombres_columnas}) values {valores};'
    
    cursor.execute(insert_query)

ProgrammingError: 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near ': 0,Rank_2024,Institution_Name,Country,Location,Academic_Reputation,Latitude,Lon' at line 1